[{
	  "title": "Inaugural Meetup!"
	, "description": "Our inaugural meetup! Join us to hear some great talks, meet local Noders, talk about projects and share ideas. Of course we'll have food and refreshments as well."
 	, "startTime": "2012-08-23T18:30:00.000-04:00"
	, "endTime": "2012-08-23T22:30:00.000-04:00"
	, "rsvp": "http://www.eventbrite.com/event/4122713146"
	, "venue": {
		    "name": "Philadelphia Center for Architecture"
		  , "address": "1218 Arch Street, Philadelphia, PA 19107"
		  , "website": "http://philadelphiacfa.org/"
	  }
	, "agenda": [{
			  "title": "Deploying Node Apps to Servers You Already Have With Stagecoach"
			, "description": "Not every Node app belongs in the cloud. The performance wins of Node can be biggest for those who bring their own servers to the party, and intranet apps often must be internally hosted. Stagecoach is a simple toolkit for painlessly deploying and hosting Node apps on Linux, especially Ubuntu Linux. The talk will cover installation of node and MongoDB from a sysadmin's perspective, deployment of Node apps with sc-deploy and hosting of multiple Node apps on the same server with sc-proxy. The stagecoach project lives here: https://github.com/punkave/stagecoach"
			, "presenters": [{
					  "name": "Tom Boutell"
					, "bio": "Tom is a senior developer at P'unk Avenue (punkave.com), a web design and development firm in South Philly where Node is rapidly taking over. He blogs about  Node and JavaScript development at justjs.com."
					, "email": "tom@punkave.com"
					, "website": "http://punkave.com"
					, "contacts": {
							  "twitter": "http://twitter.com/boutell"
							, "github": "https://github.com/boutell"
						}
				}]
		},{
			  "title": "Your Module Doesn't Exist Without Tests"
			, "description": "Unit testing is not a new thing. There are a surprising number of modules in NPM that have zero test coverage. Writing tests gives you and others confidence in your code, makes it easier to maintain and easier for others to contribute. There are plenty of unit test frameworks available, but today's talk will take a look at Jasime and how we can integrate this into our development cycle. Jasmine is a behavior-driven development framework that has no external JS dependencies. The framework lives at https://github.com/pivotal/jasmine"
			, "presenters": [{
					  "name": "Keith Elliott"
					, "bio": "Keith is a senior front-end developer at Chatham Financial. He is passionate about JavaScript, Node.js and all things mobile."
					, "email": "kelliott@chathamfinancial.com"
					, "website": "http://chathamfinancial.com"
					, "contacts": {
							  "twitter": "http://twitter.com/mrkeithelliott"
							, "github": "https://github.com/keithelliott"
						}
				}]
		},{
			  "title": "Poet"
			, "description": "Poet (http://jsantell.github.com/poet/) is a blog generator in node.js to generate routing, render markdown posts, and get a blog up and running fast. Poet may not make you blog-famous, and it may give you one less excuse for not having a blog, but just imagine the insane hipster cred you get for having node power your blog. \"Cool blog, is this Wordpress or something?\" your square friend asks. \"Nah dude, this is in node,\" you respond, while skateboarding off into the sunset, doing mad flips and stuff. Little do they know you just used Poet's autoroute generation to get your content in, like, seconds, up on that internet."
			, "presenters": [{
					  "name": "Jordan Santell"
					, "bio": "Jordan is a JavaScript developer at WebLinc (http://weblinc.com) down in Old City. He's interested in all forms of JavaScript: node.js apps and CLI tools, wrestling with audio and JavaScript in the form of browser audio APIs with dancer.js (http://github.com/jsantell/dancer.js) and audio decoding with ogg.js (http://github.com/jsantell/ogg.js), and slinging out open source JS."
					, "email": "jsantell@gmail.com"
					, "website": "http://jsantell.com"
					, "contacts": {
							  "twitter": "http://twitter.com/jsantell"
							, "github": "http://github.com/jsantell"
						}
				}]
		}]
},{
	  "title": "September Meetup & Hack Time"
	, "description": "Come join us for our second Node.Philly meetup and Hack Time! We will be at another unique space in Philly with some great talks, demos, food and beer. VoltDB will also be joining as a special guest to talk high-performance node. We are also going to kick off \"Hack Time\" which we hope will become a strong Node.Philly tradition."
 	, "startTime": "2012-09-27T18:30:00.000-04:00"
	, "endTime": "2012-09-27T22:00:00.000-04:00"
	, "rsvp": "http://www.eventbrite.com/event/4234062194"
	, "venue": {
		    "name": "MAAS Building"
		  , "address": "1325 N. Randolph St, Philadelphia, PA 19122"
		  , "website": "http://www.maasbuilding.com/"
	  }
	, "agenda": [{
			  "title": "VoltDB"
			, "description": "VoltDB (http://voltdb.com/) field engineer Andy Wilson will be on hand to talk about using VoltDB with Node.js. VoltDB recently released a Node.js driver that allows you to build Node apps that scale to hundreds of thousands of database TPS. Whether you're building a mobile app, an online game, a digital advertising system or any other application that needs incredibly high throughput and scale, VoltDB should be on your database short list."
			, "presenters": [{
					  "name": "Andy Wilson"
					, "bio": "Andy is a Field Engineer at VoltDB. Prior to VoltDB, Andy was the architect of Harvard Business Publishing's Higher Education E-commerce site, Co-founder of Visible Measures and has held senior software developer positions for the past 15 years."
					, "email": ""
					, "website": "http://voltdb.com"
					, "contacts": {
							  "blog": "http://voltdb.com/blogs/Andrew-Wilson"
						}
				}]
		},{
			  "title": "Deploying Node.js in Production"
			, "description": "Seamlessly integrating forever into your apps."
			, "presenters": [{
					  "name": "Ilya Braude"
					, "bio": "Ilya is Co-Founder, Developer, and VP of Engineering at CloudMine - a platform that provides full backend support for applications via an API, allowing developers to build fast, scalable apps quickly. Prior to CloudMine, Ilya had a blast developing next-gen (“Jack Bauer”) mobile data collaboration systems for SWAT teams and managed projects at Drexel University for the DoD as a research staff member. Ilya graduated from Drexel University with BS and MS degrees in Computer Science. He loves to play with new technologies, talk tech, and keeps himself busy with activities such as Karate and rock climbing."
					, "email": ""
					, "website": "http://cloudmine.me/"
					, "contacts": {
							  "twitter": "http://twitter.com/ilybr"
						}
				}]
		}]
},{
	  "title": "October Meetup & Hack Time"
	, "description": "Another month, another great night of Node.js. We will be at the 'Search Church' this month talking and hacking streams with special guest Luke Arduini coming down from NYC to join us."
 	, "startTime": "2012-10-25T18:30:00.000-04:00"
	, "endTime": "2012-10-25T22:00:00.000-04:00"
	, "rsvp": "http://www.eventbrite.com/event/4615290458"
	, "venue": {
		    "name": "SEER Interactive (The Search Church)"
		  , "address": "1028 N. 3rd Street, Philadelphia, PA 19123"
		  , "website": "http://www.seerinteractive.com/inside-seer/new-office"
	  }
	, "agenda": [{
			  "title": "Then I'll See You In Hell"
			, "description": "You don't want to miss this."
			, "presenters": [{
					  "name": "Luke Arduini"
					, "bio": "Luke is a Javascript fanatic and evangelist who thinks that server-side Javascript by way of node.js is changing the face of programming. He's currently curating EmpireJS and writing Javascript for every level of the stack at a cloud services company in NYC."
					, "email": ""
					, "website": "http://luke.xxx"
					, "contacts": {
							  "twitter": "http://twitter.com/st_luke"
						}
				}]
		},{
			  "title": "Creating CLI Modules"
			, "description": "A walkthrough and experience share of creating my first CLI module with Node."
			, "presenters": [{
					  "name": "Matt Parke"
					, "bio": "Matt is a JavaScript developer who loves learning new things. He's currently interested in writing node.js for single page apps and client side JavaScript libraries."
					, "email": ""
					, "website": "http://ordinaryrobot.com"
					, "contacts": {
							  "twitter": "http://twitter.com/matt_parke",
							  "github": "https://github.com/mparke"
						}
				}]
		}]
}]